{
    "es": {
        "nav": {
        "home": "Inicio",
        "about": "Acerca de mí",
        "proyect": "Proyectos"
        
        },
        "basicInfo":{
            "title": "Desarrollador de software",
            "info": "Hola, soy Nicholas. Me especializo en desarrollo frontend y disfruto dar vida a las ideas a través del código. Mi meta es convertirme en desarrollador full stack, ampliando mis habilidades para dominar tanto el lado visual como la lógica detrás de cada aplicación."
        },
        
        "titleProyect":{
            "title":"Proyectos"
        },
        "proyects": [
        {
            "subtitle": "Tienda EcoGaia",
            "info": "Una tienda online ecológica desarrollada con HTML, CSS y JavaScript. Incluye carrito de compras y buscador dinámico.",
            "img": "img/Proyecto1/proyecto1.png",
            "video": "img/Proyecto1/2025-09-01 13-42-35.mp4",
            "links": { "code": "https://github.com/NichoHC/TiendaEcoGaia", "demo": "https://nichohc.github.io/TiendaEcoGaia/" }
        }
    ],"links": { "code": "Código", "Demo": "Demo" },
    "About":{
        "title":"Acerca de mí",
        "info":"Soy Ingeniero Mecatrónico de la Universidad Autónoma, pero con el tiempo descubrí que mi verdadera pasión está en el desarrollo web. Siempre me ha gustado aprender, experimentar y dar forma a nuevas ideas. Fuera del código disfruto los videojuegos, la música y pasar tiempo en la naturaleza. Me considero curioso, perseverante y en constante búsqueda de crecimiento. Mi meta es consolidarme como frontend developer y seguir avanzando hasta convertirme en full stack."
    }
    
    },
    "en": {
        "nav": {
        "home": "Home",
        "about": "About me",
        "proyect": "Proyects"
        },
        "basicInfo":{
            "title": "Software Developer",
            "info": "Hi, I'm Nicholas. I specialize in frontend development and enjoy bringing ideas to life through code. I'm working towards becoming a full stack developer, expanding my skills to master both the visual side and the logic behind every application."
        },
        "titleProyect":{
            "title":"Proyects"
        },
        "proyects": [
        {
                "subtitle": "EcoGaia Shop",
                "info": "An eco-friendly online store developed with HTML, CSS, and JavaScript. It includes a shopping cart and a dynamic search feature.",
                "img": "img/Proyecto1/proyecto1.png",
                "video": "img/Proyecto1/2025-09-01 13-42-35.mp4",
                "links": { 
                    "code": "https://github.com/NichoHC/TiendaEcoGaia", 
                    "demo": "https://nichohc.github.io/TiendaEcoGaia/" 
                }
        }
        
    ],"links": { "code": "Code", "Demo": "Demo" },
    "About":{
        "title":"About me",
        "info":"I am a Mechatronics Engineer from Universidad Autónoma, but over time I discovered that my true passion lies in web development. I’ve always enjoyed learning, experimenting, and bringing new ideas to life. Outside of coding, I enjoy video games, music, and spending time in nature. I consider myself curious, persistent, and always eager to grow. My goal is to establish myself as a frontend developer and keep moving forward until I become a full stack developer."
    }
    
    }
}